

#Область ОбработчикиКомандФормы

&НаКлиенте
procedure OpenFile(command)
	
	Сообщить("CP01-", СтатусСообщения.Внимание);
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр = "XML (*.xml)|*.xml";
	ДиалогФыбораФайла.Заголовок = "Выберите файл";                                         
	ДиалогФыбораФайла.ПредварительныйПросмотр = true;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	Если ДиалогФыбораФайла.Выбрать() Тогда
   		// Действия, выполняемые тогда, когда файл выбран.
		ПолноеИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;	
	
endProcedure

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицы()
	
	S = Новый ОписаниеТипов("Строка");
	D = Новый ОписаниеТипов("Число",
        Новый КвалификаторыЧисла(15, 2));
		
	t = РеквизитФормыВЗначение("ТабФайл");
	
	t.Колонки.Добавить("НомСтр", D, "№");
	t.Колонки.Добавить("ВидДвижения", S, "ВидДвижения");
					
	НовыеРеквизиты = Новый Массив;
	
    Для Каждого Колонка Из t.Колонки Цикл
         НовыеРеквизиты.Добавить(
            Новый РеквизитФормы(
                Колонка.Имя, Колонка.ТипЗначения,
                "ТабФайл"
            )
         );
	КонецЦикла;	
		 
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Для Каждого Колонка Из t.Колонки Цикл
		Колонка.Заголовок = Колонка.Имя + "HEAD";      // ?
        НовыйЭлемент = Элементы.Добавить(
            "" + t + "_" + Колонка.Имя, Тип("ПолеФормы"), Элементы["ТабФайлФ"]
        );
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = "ТабФайл" + "." + Колонка.Имя;
    КонецЦикла;
	ЗначениеВРеквизитФормы(t, "ТабФайл");
	
	
// ..............................................................................	

	m = РеквизитФормыВЗначение("мТехПрокачка");
	m.Колонки.Добавить("Index", S, "1");
	m.Колонки.Добавить("Объём", D, "2");

	НовыеРеквизиты = Новый Массив;
 
    Для Каждого Колонка Из m.Колонки Цикл
         НовыеРеквизиты.Добавить(
            Новый РеквизитФормы(
                Колонка.Имя, Колонка.ТипЗначения,
                "мТехПрокачка"
            )
         );
	КонецЦикла;	
		 
	ИзменитьРеквизиты(НовыеРеквизиты);
	 
		 
//	Для Каждого Колонка Из m.Колонки Цикл
//        НовыйЭлемент = Элементы.Добавить(
//            "" + m + "_" + Колонка.Имя, Тип("ПолеФормы"), Элементы["мТехПрокачка1"]
//        );
//        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//        НовыйЭлемент.ПутьКДанным = "мТехПрокачка" + "." + Колонка.Имя;
//    КонецЦикла;

	ЗначениеВРеквизитФормы(m, "мТехПрокачка");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сообщить("CP02", СтатусСообщения.Внимание);	

	ПриОткрытииНаСервере();
	СоздатьТаблицы();
	
	Сообщить(мТехПрокачка, СтатусСообщения.Внимание);	
	
КонецПроцедуры
	
#КонецОбласти

