#Область ПрограммныйИнтерфейс



//Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("1.1.1.1");
	
	//ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Версия = "0.1";
	//ПараметрыРегистрации.БезопасныйРежим = true; //false;
	
	//НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	//НоваяКоманда.Представление = НСтр("ru = 'T01'");
	//НоваяКоманда.Идентификатор = "Test01";
	//НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	//НоваяКоманда.ПоказыватьОповещение = Истина;
	
	//Возврат null;//ПараметрыРегистрации;
	
//КонецФункции

#КонецОбласти

